/css/style.css генерится препроцессором. Ни в коем случае не редактировать его.
Если нужно добавить стили, а с препроцессором разбираться неохота, создайте себе отдельную цсску и подключайте: когда верстка будет завершена, можно будет уже свести все в один файл.


/i/data-uri/
Картинки из этой папки не используются напрямую, а подключены в цсс с помощью data-uri.


в css/stylus/base/layout.styl в min-aspect-ratio нужно писать соотношение ширины на высоту картинки дома на фоне


Футер местами фиксированный, местами нет. Делал на свое усмотрение. Отвечает за фикс футера класс .__fixed